src/main/java/ok/dht/test/ushkov/report/stage5/profiles/2022-11-02-01-12-11_ack1_from1_connectionTimeout500ms_anotherOneExecutor_put_t4_c64_R20000_d1m/wrk2.txt
Running 1m test @ http://localhost:1337
  4 threads and 64 connections
  Thread calibration: mean lat.: 947.063ms, rate sampling interval: 2537ms
  Thread calibration: mean lat.: 942.813ms, rate sampling interval: 2541ms
  Thread calibration: mean lat.: 942.404ms, rate sampling interval: 2537ms
  Thread calibration: mean lat.: 943.948ms, rate sampling interval: 2543ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.75s   660.11ms   3.39s    67.11%
    Req/Sec     4.78k   499.36     5.64k    68.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.90s 
 75.000%    2.28s 
 90.000%    2.52s 
 99.000%    2.87s 
 99.900%    3.15s 
 99.990%    3.33s 
 99.999%    3.38s 
100.000%    3.39s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      97.407     0.000000            1         1.00
     702.463     0.100000        94999         1.11
    1148.927     0.200000       189901         1.25
    1360.895     0.300000       285050         1.43
    1650.687     0.400000       379996         1.67
    1895.423     0.500000       474964         2.00
    1984.511     0.550000       522498         2.22
    2062.335     0.600000       569703         2.50
    2136.063     0.650000       617519         2.86
    2203.647     0.700000       665571         3.33
    2275.327     0.750000       712439         4.00
    2312.191     0.775000       736084         4.44
    2349.055     0.800000       760662         5.00
    2383.871     0.825000       783305         5.71
    2426.879     0.850000       807105         6.67
    2473.983     0.875000       831188         8.00
    2494.463     0.887500       842553         8.89
    2519.039     0.900000       854651        10.00
    2545.663     0.912500       866632        11.43
    2576.383     0.925000       878846        13.33
    2611.199     0.937500       890481        16.00
    2631.679     0.943750       896247        17.78
    2654.207     0.950000       902037        20.00
    2674.687     0.956250       908039        22.86
    2699.263     0.962500       913835        26.67
    2725.887     0.968750       919860        32.00
    2742.271     0.971875       922682        35.56
    2762.751     0.975000       925880        40.00
    2779.135     0.978125       928893        45.71
    2797.567     0.981250       931754        53.33
    2820.095     0.984375       934606        64.00
    2832.383     0.985938       936097        71.11
    2846.719     0.987500       937620        80.00
    2861.055     0.989062       938989        91.43
    2877.439     0.990625       940536       106.67
    2906.111     0.992188       942017       128.00
    2916.351     0.992969       942710       142.22
    2932.735     0.993750       943511       160.00
    2947.071     0.994531       944229       182.86
    2979.839     0.995313       944943       213.33
    3000.319     0.996094       945714       256.00
    3010.559     0.996484       946060       284.44
    3020.799     0.996875       946391       320.00
    3037.183     0.997266       946809       365.71
    3051.519     0.997656       947186       426.67
    3071.999     0.998047       947503       512.00
    3082.239     0.998242       947689       568.89
    3090.431     0.998437       947878       640.00
    3104.767     0.998633       948077       731.43
    3131.391     0.998828       948254       853.33
    3147.775     0.999023       948431      1024.00
    3155.967     0.999121       948521      1137.78
    3174.399     0.999219       948626      1280.00
    3190.783     0.999316       948713      1462.86
    3203.071     0.999414       948805      1706.67
    3219.455     0.999512       948899      2048.00
    3225.599     0.999561       948952      2275.56
    3227.647     0.999609       948987      2560.00
    3233.791     0.999658       949042      2925.71
    3239.935     0.999707       949077      3413.33
    3282.943     0.999756       949129      4096.00
    3287.039     0.999780       949154      4551.11
    3291.135     0.999805       949171      5120.00
    3301.375     0.999829       949193      5851.43
    3309.567     0.999854       949224      6826.67
    3313.663     0.999878       949242      8192.00
    3319.807     0.999890       949255      9102.22
    3330.047     0.999902       949264     10240.00
    3342.335     0.999915       949275     11702.86
    3360.767     0.999927       949286     13653.33
    3366.911     0.999939       949300     16384.00
    3368.959     0.999945       949303     18204.44
    3371.007     0.999951       949314     20480.00
    3373.055     0.999957       949323     23405.71
    3373.055     0.999963       949323     27306.67
    3375.103     0.999969       949332     32768.00
    3375.103     0.999973       949332     36408.89
    3375.103     0.999976       949332     40960.00
    3377.151     0.999979       949340     46811.43
    3377.151     0.999982       949340     54613.33
    3379.199     0.999985       949346     65536.00
    3379.199     0.999986       949346     72817.78
    3379.199     0.999988       949346     81920.00
    3379.199     0.999989       949346     93622.86
    3381.247     0.999991       949347    109226.67
    3383.295     0.999992       949349    131072.00
    3383.295     0.999993       949349    145635.56
    3385.343     0.999994       949350    163840.00
    3385.343     0.999995       949350    187245.71
    3387.391     0.999995       949353    218453.33
    3387.391     0.999996       949353    262144.00
    3387.391     0.999997       949353    291271.11
    3387.391     0.999997       949353    327680.00
    3387.391     0.999997       949353    374491.43
    3387.391     0.999998       949353    436906.67
    3389.439     0.999998       949354    524288.00
    3389.439     0.999998       949354    582542.22
    3389.439     0.999998       949354    655360.00
    3389.439     0.999999       949354    748982.86
    3389.439     0.999999       949354    873813.33
    3391.487     0.999999       949355   1048576.00
    3391.487     1.000000       949355          inf
#[Mean    =     1752.484, StdDeviation   =      660.110]
#[Max     =     3389.440, Total count    =       949355]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1141779 requests in 1.00m, 72.96MB read
  Non-2xx or 3xx responses: 104
Requests/sec:  19029.81
Transfer/sec:      1.22MB